<template>
  <div class="wrapper">
    <TheBreadCrumbs :breadCrumbs="breadCrumbs" />
    <div class="license">
      <h1 class="license__title title-b">Лицензионный договор</h1>
      <div 
        v-for="(item, i) in list"
        :key="i"
        class="license-block"
      >
        <div class="license-block__title title-b">{{ item.title }}</div>
        <div class="license-block__text">
          <p v-for="(text, i) in item.text" :key="i">{{ text }}</p>
        </div>
      </div>
    </div>
  </div>
  
</template>

<script>
export default {
  data() {
    return {
      breadCrumbs: [
        {
          name: 'Документы',
          url: '#',
          current: false
        },
        {
          name: 'Лицензионный договор',
          url: '#',
          current: true
        }
      ],
      list: [
        {
          title: 'Заголовок 1',
          text: ['Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях.', 'Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси.']
        },
        {
          title: 'Заголовок 2',
          text: ['Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. ']
        },
        {
          title: 'Заголовок 3',
          text: ['Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях.', 'Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. ']
        }
      ]
    }
  }
}
</script>

<style lang="scss">
.license {
  &__title {
    margin-bottom: 40px;
  }
}
.license-block {
  margin-bottom: 45px;
  p {
    margin-bottom: 15px;
    &:last-child {
      margin-bottom: 0;
    }
  }
  &__title {
    padding-bottom: 25px;
  }
}
</style>